; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	thermograph1 - mode
	image0 - mode
	Star0 - direction
	Star3 - direction
	Star1 - direction
	GroundStation4 - direction
	Star2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 image0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star3)
	(supports instrument8 thermograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star1)
	(supports instrument9 image0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
	(supports instrument10 image0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star2)
	(supports instrument11 thermograph1)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
	(supports instrument12 image0)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 image0)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 Star2)
	(supports instrument14 thermograph1)
	(supports instrument14 image0)
	(calibration_target instrument14 Star2)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 Planet10)
	(pointing satellite5 GroundStation4)
	(have_image Star5 thermograph1)
	(have_image Planet6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Planet9 image0)
	(have_image Planet10 image0)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Planet13 thermograph1)
))

)

; plan
1. (turn_to satellite1 star0 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star0)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite1 planet9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet9)
   goals met: 0 of 12
5. (take_image satellite1 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 1 of 12
6. (turn_to satellite1 planet6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet6)
   goals met: 1 of 12
7. (take_image satellite1 planet6 instrument3 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite1 planet13 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet13)
   goals met: 2 of 12
9. (take_image satellite1 planet13 instrument3 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 3 of 12
10. (turn_to satellite1 phenomenon12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 12
11. (take_image satellite1 phenomenon12 instrument3 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 4 of 12
12. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 12
13. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 5 of 12
14. (take_image satellite1 phenomenon11 instrument3 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 6 of 12
15. (turn_to satellite1 star5 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star5)
   goals met: 6 of 12
16. (take_image satellite1 star5 instrument3 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 7 of 12
17. (turn_to satellite1 star7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star7)
   goals met: 7 of 12
18. (take_image satellite1 star7 instrument3 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 8 of 12
19. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 8 of 12
20. (take_image satellite1 star8 instrument3 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 9 of 12
21. (turn_to satellite1 planet10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet10)
   goals met: 10 of 12
22. (take_image satellite1 planet10 instrument3 image0)
   added: (have_image planet10 image0)
   goals met: 11 of 12
23. (turn_to satellite5 groundstation4 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 groundstation4)
   goals met: 12 of 12
